In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("utilizar_copia.csv", index_col = 0)
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN

In [4]:
df.dtypes

case_number     object
year             int64
type            object
country         object
area            object
location        object
activity        object
name            object
age             object
time            object
species_        object
injury          object
fecha_limpia    object
fatal_clean     object
sexo            object
dtype: object

Ejercicio 1

In [5]:
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN

In [6]:
df["species_"].unique()

array([nan, 'Tiger shark?', 'White sharks', ...,
       "Said to involve a 6 m to 7.3 m [20' to 24'] shark",
       "Said to be a 7.6 m [25'] shark",
       'Thought to involve a porbeagle or mako shark'], dtype=object)

Vamos a clasificar los tiburones en 5 especies: tiburón blanco (White), el tiburón tigre (Tiger ), el tiburón gris (Grey), el tiburón limón (Lemon) y el tiburón toro (Bull) y el resto en 'Unspecified'

Pistas: regex para buscar strings (5 patrones diferentes) y crear función en la que aplicamos el patrón regex

In [39]:
df_copia1 = df.copy()

In [40]:
patron_white = '[WwIiTtHhEe]{5}'
patron_tiger = '[TtIiGgEeRr]{5}'
patron_grey = '[GgRrEeYy]{4}'
patron_lemon = '[LeMmOoNn]{4}'
patron_bull =  '[BbUuLl]{3}'

In [ ]:
#df["species_"].str.split(pat = patron_white , n= , expand= False, regex = True)

In [41]:
df_copia1.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN

In [42]:
df_copia1.dtypes

case_number     object
year             int64
type            object
country         object
area            object
location        object
activity        object
name            object
age             object
time            object
species_        object
injury          object
fecha_limpia    object
fatal_clean     object
sexo            object
dtype: object

In [43]:
def patrones(w,t,g,l,b):
    for i in df_copia1['species_']:
        try:
            if w in i:
                df_copia1.replace(i, w, inplace=False)
            elif t in i:
                df_copia1.replace(i, t, inplace=False)
            elif g in i:
                df_copia1.replace(i, g, inplace=False)
            elif l in i:
                df_copia1.replace(i, l, inplace=False)
            elif b in i:
                df_copia1.replace(i, b, inplace=False)
        except:
            df_copia1.replace(i, 'undefine', inplace=False)
      
patrones(patron_white, patron_tiger, patron_grey, patron_lemon, patron_bull)

In [44]:
df_copia1.head(15)

,case_number,year,type,country,area,location,activity,name,age,time,species_,injury,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800,Unprovoked,seychelles,St. Anne,NaN,a corsair's boat was overturned,NaN,NaN,NaN,NaN,"FATAL, all onboard were killed by sharks",NaN,Y,F
1,1797.05.28.R,1797,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,FATAL,May,Y,NaN
2,1792.09.12,1792,Provoked,england,NaN,On the Thames River,Fishing,male,NaN,NaN,NaN,"FATAL, PROVOKED INCIDENT",Sep,Y,M
3,1791.00.00,1791,Unprovoked,australia,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",NaN,NaN,NaN,"FATAL, ""bitten in two""",NaN,Y,F
4,1788.05.10,1788,Boat,australia,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,"No injury to occupants, shark bit oar and rudder",May,N,NaN
5,1787.07.05,1787,Unprovoked,NaN,St Helena,Landing Place,Swimming,Private Isaac Hicksled,NaN,NaN,NaN,FATAL,Jul,Y,M
6,1786.08.10.R,1786,Unprovoked,barbados,NaN,NaN,Washing himself,a sailor from the York Merchant,NaN,NaN,NaN,FATAL,Aug,Y,M
7,1785.09.26.R,1785,Unprovoked,england,Sussex,Brighton,NaN,NaN,NaN,NaN,Tiger shark?,Human remains recovered from shark,Sep,Y,M
8,1784.12.12,1784,Unprovoked,jamaica,NaN,Kingston,Swimming,Richard Page,NaN,22h00,NaN,NaN,Dec,Y,M
9,1783.03.02,1783,Sea Disaster,martinique,NaN,Foundering of the privateer Holker,NaN,NaN,NaN,06h00,NaN,Many of the crew were taken by sharks,Mar,Y,M
10,1780.08.08,1780,Unprovoked,usa,Florida,"Pensacola Harbor, Escambia County",Swimming,Joseph Feron,NaN,NaN,NaN,FATAL,Aug,Y,M
11,1779.00.00,1779,Unprovoked,usa,Hawaii,"Maliu, Hawai'i",Surfing,Nu'u-anu-pa'a hu,young,NaN,NaN,"FATAL, buttock lacerated",NaN,Y,M
12,1776.00.00.R,1776,Unprovoked,guinea,NaN,NaN,Murder,African slave,NaN,NaN,NaN,FATAL,NaN,Y,M
13,1776.00.00.b,1776,Boat,greenland,NaN,NaN,NaN,Occupants of skin boats,NaN,NaN,White sharks,FATAL,NaN,Y,NaN
14,1771.07.12.R,1771,Unprovoked,usa,NaN,Damiscotte,Fishing,male,NaN,NaN,NaN,FATAL,Jul,Y,M

In [45]:
df_copia1['species_'].map(patrones, na_action= None)

TypeError: patrones() missing 4 required positional arguments: 't', 'g', 'l', and 'b'